- pandas는 numpy 2차원 배열에서 가능한 대부분의 데이터 처리 가능  
- 데이터 처리 및 변환을 위한 다양한 function과 method 제공

# 데이터 개수 세기 - count

`count` : NaN 값 제외

## Series count

In [2]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series(range(10))

In [5]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [6]:
s[3]

3

In [9]:
s.loc[5:9]

5    5
6    6
7    7
8    8
9    9
dtype: int64

In [10]:
s.loc[5,9]

IndexingError: Too many indexers

In [11]:
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [13]:
s.count()

9

## dataframe count

In [14]:
np.random.seed(2)

In [16]:
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)

In [17]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  2.0
3  0.0  4.0  4.0  2.0

In [34]:
df.loc[2,3] = np.nan

In [35]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [36]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

# titanic dataset

## titanic dataset 불러오기

In [17]:
import seaborn as sns

In [18]:
titanic = sns.load_dataset('titanic')

In [43]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## 데이터 길이 확인

In [44]:
len(titanic)

891

## 데이터 개수 구하기

dataframe 각 열마다 개수 구하기

In [46]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 카테고리 값 세기

`value_counts` : 시리즈의 값이 **정수, 문자열, 카테고리**인 경우 각각의 값이 나온 횟수를 셀 수 있다

### Series value_counts

In [47]:
import pandas as pd
np.random.seed(1)

s2 = pd.Series(np.random.randint(6, size=100))
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [48]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [51]:
s2.count()

100

### Dataframe은 value_counts method 없음

각 열마다 별도 적용

In [52]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [55]:
df.value_counts()

0    1    2    3
0.0  4.0  4.0  2.0    1
2.0  4.0  3.0  0.0    1
3.0  3.0  2.0  1.0    1
Name: count, dtype: int64

In [57]:
df[0].value_counts()

0
3.0    1
2.0    1
4.0    1
0.0    1
Name: count, dtype: int64

In [64]:
for i in range(len(df)):
    print(df[i].value_counts())
    print('--------'*5)

0
3.0    1
2.0    1
4.0    1
0.0    1
Name: count, dtype: int64
----------------------------------------
1
3.0    2
4.0    2
Name: count, dtype: int64
----------------------------------------
2
2.0    1
3.0    1
1.0    1
4.0    1
Name: count, dtype: int64
----------------------------------------
3
1.0    1
0.0    1
2.0    1
Name: count, dtype: int64
----------------------------------------

## 정렬

`sort_index` : 인덱스 값 기준  
`sort_values` : 데이터 값 기준

### Series 정렬

In [66]:
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [68]:
s2.sort_index()

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [69]:
s2.sort_index(ascending=False)

99    3
98    4
97    2
96    5
95    4
     ..
4     1
3     0
2     4
1     3
0     5
Length: 100, dtype: int32

In [70]:
s2.sort_values()

57    0
38    0
39    0
85    0
28    0
     ..
71    5
40    5
46    5
11    5
0     5
Length: 100, dtype: int32

In [71]:
s2.sort_values(ascending=False)

0     5
74    5
23    5
32    5
40    5
     ..
68    0
57    0
77    0
38    0
78    0
Length: 100, dtype: int32

In [76]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [73]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
Name: count, dtype: int64

In [74]:
s2.value_counts().sort_index(ascending=False)

5    16
4    17
3    14
2    13
1    22
0    18
Name: count, dtype: int64

In [75]:
s2.value_counts().sort_values()

2    13
3    14
5    16
4    17
0    18
1    22
Name: count, dtype: int64

In [77]:
s2.value_counts().sort_values(ascending=False)

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [78]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [79]:
s.sort_index()

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [80]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [81]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

### DataFrame 정렬

`by` 인수로 정렬 기준이 되는 열을 지정해줘야 한다.

In [82]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [84]:
df.sort_values(by=0)

     0    1    2    3
3  0.0  4.0  4.0  2.0
1  2.0  4.0  3.0  0.0
0  3.0  3.0  2.0  1.0
2  4.0  3.0  1.0  NaN

`by` 인수에 리스트를 넣으면 리스트 값 순서대로 정렬 기준의 우선 순위가 된다.  
리스트의 첫번째 값을 열의 기준으로 정렬한 후, 동일한 값이 나오면 그 다음 값을 열의 기준으로 정렬한다.

In [88]:
df.sort_values(by=1)

     0    1    2    3
0  3.0  3.0  2.0  1.0
2  4.0  3.0  1.0  NaN
1  2.0  4.0  3.0  0.0
3  0.0  4.0  4.0  2.0

In [87]:
df.sort_values(by=[1,2])

     0    1    2    3
2  4.0  3.0  1.0  NaN
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
3  0.0  4.0  4.0  2.0

## 연습문제 1

`sort_values` 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [89]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [95]:
titanic[['sex', 'age', 'class', 'alive']].count()

sex      891
age      714
class    891
alive    891
dtype: int64

In [96]:
label = ['sex', 'age', 'class', 'alive']

In [103]:
for i in label:
    print(titanic[i].value_counts())
    print('--------'*5)

sex
male      577
female    314
Name: count, dtype: int64
----------------------------------------
age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64
----------------------------------------
class
Third     491
First     216
Second    184
Name: count, dtype: int64
----------------------------------------
alive
no     549
yes    342
Name: count, dtype: int64
----------------------------------------

## 행/열 합계

`sum(axis)` : `axis` 인수에는 합할 방향축 지정 (0 = 행, 1 = 열)

In [104]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [110]:
df2.sum(axis=1) # 열방향 합계 = 행합계

0    35
1    34
2    41
3    42
dtype: int64

In [112]:
df2.sum(axis=0) # 행방향 합계 = 열합계

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [114]:
df2['rowsum'] = df2.sum(axis=1)

In [115]:
df2

   0  1  2  3  4  5  6  7  rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [117]:
df2.loc['colsum'] = df2.sum(axis=0) # 행에 인덱스와 값을 넣으려면 loc

In [118]:
df2

         0   1   2   3   4   5  6   7  rowsum
0        5   8   9   5   0   0  1   7      35
1        6   9   2   4   5   2  4   2      34
2        4   7   7   9   1   7  0   6      41
3        9   9   7   6   9   1  0   1      42
colsum  24  33  25  24  15  10  5  16     152

## 행/열 평균

`mean(axis)`

In [120]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [122]:
df.mean(axis=0) # 행방향 = 열계산

0    2.25
1    3.50
2    2.50
3    1.00
dtype: float64

In [123]:
df.mean(axis=1) # 열방향 = 행계산

0    2.250000
1    2.250000
2    2.666667
3    2.500000
dtype: float64

## 연습문제 2

1. 타이타닉호 승객의 평균 나이를 구하라.
2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [124]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [127]:
# 1
titanic['age'].mean(axis=0)

29.69911764705882

In [132]:
# 2
titanic[titanic['sex'] == 'female']['age'].mean(axis=0)

27.915708812260537

In [139]:
# 3
titanic[(titanic['class'] == 'First') & (titanic['sex'] == 'female')]['age'].mean(axis=0)

34.61176470588235

## apply 변환

인수로 행 또는 열을 받는 함수를 `apply` 메서드의 인수로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용시킨다.

In [3]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [6]:
df3.max()-df3.min()

A    3
B    2
C    4
dtype: int64

In [7]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [8]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [9]:
df3.value_counts()

A  B  C
1  2  1    1
3  2  4    1
   3  5    1
4  1  2    1
   3  4    1
Name: count, dtype: int64

In [15]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

## 연습문제 3

타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열을 만들어 보자.

In [22]:
titanic['adult/child'] = titanic.apply(lambda x: 'adult' if x.age >= 20 else 'child', axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult

## 연습문제 4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 `category1` 열을 만들어라.   
`category1` 카테고리는 다음과 같이 정의된다.

1. 20살이 넘으면 성별을 그대로 사용한다.
2. 20살 미만이면 성별에 관계없이 "child"라고 한다.

In [25]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else 'child', axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

## fillna method

NaN 값은 `fillna` 메서드를 사용하여 원하는 값으로 바꿀 수 있다.

In [26]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [27]:
df3['A']

0    1
1    3
2    4
3    3
4    4
Name: A, dtype: int64

In [28]:
df3['A'].value_counts()

A
3    2
4    2
1    1
Name: count, dtype: int64

In [29]:
df3.value_counts()

A  B  C
1  2  1    1
3  2  4    1
   3  5    1
4  1  2    1
   3  4    1
Name: count, dtype: int64

In [30]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [31]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 연습문제 5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [34]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
adult/child      0
category1        0
dtype: int64

In [40]:
titanic['age'].isnull().sum() # age null 개수

177

In [41]:
round(titanic['age'].mean(), 2) # 고객 평균 나이

29.7

In [45]:
titanic['age'] = titanic['age'].fillna(round(titanic['age'].mean(), 2))

In [46]:
titanic['age'].isnull().sum()

0

In [48]:
titanic['age'].mean()

29.69929292929293

In [49]:
titanic['age'].value_counts()

age
29.70    177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: count, Length: 89, dtype: int64

## astype method

`astype` 메서드로 전체 데이터의 자료형을 바꾸는 것도 가능하다.

In [50]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [53]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

## 연습문제 6

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 `category2` 열을 만들어라.   
`category2` 카테고리는 다음과 같이 정의된다.

1. 성별을 나타내는 문자열 `male` 또는 `female`로 시작한다.
2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
3. 예를 들어 27살 남성은 `male27` 값이 된다.

In [62]:
titanic['category2'] = titanic['sex'] + titanic['age'].astype(int).astype(str)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female35
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,female19
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,female29
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32

## 실수 값을 카테고리 값으로 변환

실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 때는 다음과 같은 명령을 사용한다.

- `cut`: 실수 값의 경계선을 지정하는 경우
- `qcut`: 갯수가 똑같은 구간으로 나누는 경우

In [63]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

`cut` 명령을 사용하면 실수값을 다음처럼 카테고리 값으로 바꿀 수 있다.  
`bins` 인수는 카테고리를 나누는 기준값이 된다. 영역을 넘는 값은 NaN으로 처리된다.

In [65]:
bins = [1, 20, 40, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [68]:
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '청년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

`cut` 명령이 반환하는 값은 Categorical 클래스 객체이다. 이 객체는 `categories` 속성으로 라벨 문자열을, `codes` 속성으로 정수로 인코딩한 카테고리 값을 가진다.

In [69]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [71]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [72]:
cats.codes

array([-1,  0,  0,  1,  1,  1,  1,  3,  0,  2,  1, -1], dtype=int8)

In [74]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   101

In [76]:
df4['age_cat'] = pd.cut(df4.ages, bins, labels=labels)
print(bins)
print(labels)
df4

[1, 20, 40, 50, 70, 100]
['미성년자', '청년', '중년', '장년', '노년']

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      청년
6     31      청년
7     61      장년
8     20    미성년자
9     41      중년
10    32      청년
11   101     NaN

따라서 위 데이터프레임의 age_cat 열값은 문자열이 아니다. 이를 문자열로 만들려면 `astype` 메서드를 사용해야 한다.

In [77]:
df4['age_cat']

0      NaN
1     미성년자
2     미성년자
3       청년
4       청년
5       청년
6       청년
7       장년
8     미성년자
9       중년
10      청년
11     NaN
Name: age_cat, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [79]:
df4.age_cat.astype(str) + df4.ages.astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       청년37
6       청년31
7       장년61
8     미성년자20
9       중년41
10      청년32
11    nan101
dtype: object

`qcut` 명령은 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눈다.
예를 들어 다음 코드는 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가진다.

In [81]:
data = np.random.randn(1000)
data

array([-2.07408573e-01,  2.34041686e-01, -1.20376383e+00, -5.03335292e-01,
        1.14530748e+00,  6.01613172e-01, -1.67226126e+00, -2.34291376e+00,
        3.30691277e-01,  6.76664497e-01,  1.00235998e+00, -1.09882141e+00,
       -7.72171272e-04,  2.34685965e-01,  1.10992307e+00,  1.47925491e+00,
        7.95047155e-01,  1.62532529e+00, -7.23012709e-02,  1.65004781e+00,
        1.00336405e+00, -6.46131670e-01, -3.60768670e-01, -5.46780368e-01,
        1.23833846e+00, -6.93988214e-01, -1.00200741e+00, -9.71394311e-01,
        4.87162514e-01,  7.27931715e-01,  1.27855358e+00,  7.77205562e-02,
       -8.60115416e-01,  9.11161765e-01,  2.50899485e+00,  8.83104260e-01,
        7.93650445e-01,  2.24497026e+00,  4.05603666e-01, -7.29913456e-01,
       -1.16754432e+00, -2.24904517e+00,  1.49361773e+00,  1.18442466e-01,
        2.96126835e+00,  1.57644622e+00, -2.04586152e+00,  5.36725590e-01,
       -5.67447504e-01, -5.89874396e-01, -1.28105541e+00, -1.19556264e+00,
        8.40090425e-01,  1.78459386e+00, -1.70497681e-01,  3.86198630e-01,
       -6.22827590e-01,  9.80498250e-01,  1.84042553e+00, -2.82876962e-02,
       -2.21123161e-01,  4.81859921e-01,  3.89831028e-01, -1.69009668e+00,
       -1.00414151e-01,  4.18819445e-01,  4.74893693e-01,  1.81802828e+00,
       -1.51725921e+00,  1.97561249e+00, -7.03352190e-01, -4.89159601e-01,
       -2.16759954e-01, -4.14664962e-01, -6.75262656e-01,  2.83211508e-01,
        3.39596725e-01, -8.96493036e-02,  5.68639464e-01,  2.44067224e+00,
       -7.00092002e-01,  9.81174407e-01,  2.27773444e-01,  1.99802724e+00,
        1.49371979e-01,  2.45735985e-01,  2.80654856e-01,  3.35108866e-01,
        6.14056625e-01, -9.36068716e-01,  8.18295076e-01, -8.91444152e-01,
        1.95985193e-01,  9.79368740e-02,  2.44585801e-01,  4.93926297e-01,
        1.11611776e-02, -2.93735094e-01,  6.61819140e-01,  7.95287879e-01,
       -8.50820745e-01, -1.07211850e+00,  6.79403921e-01,  2.56231620e-01,
       -1.45303144e+00,  5.38334949e-01, -1.21916240e+00, -1.51621839e-01,
       -1.32396842e+00, -9.19076191e-01,  5.75029508e-01,  3.31099644e-01,
       -1.31238457e+00, -2.66454616e-01,  1.43922972e-01, -5.14207887e-01,
       -6.97354574e-02, -1.01946318e+00,  4.08206623e-01, -1.15548429e+00,
        1.00130664e-01,  1.15860354e+00,  4.10365746e-01, -2.52812235e-01,
        1.57240262e+00, -9.09715462e-01, -6.75351571e-01,  9.33167103e-01,
        1.29002310e+00,  5.56324138e-02, -1.72398713e+00,  8.73928555e-01,
        1.19962971e+00,  9.58997789e-01, -6.09378972e-01,  1.03470830e+00,
        6.73594543e-02,  5.49420359e-01, -7.02079560e-01, -2.00195209e-01,
       -1.36259749e-01,  5.71919252e-01,  1.92619688e-01,  6.61538300e-01,
       -4.16217930e-01, -4.37294870e-01,  9.19197899e-01, -2.08711360e-02,
        6.04164149e-03, -9.79305470e-01, -4.39904178e-01,  1.12691988e+00,
        4.28107579e-01,  2.20626285e+00,  3.05050952e-01, -1.33943098e+00,
       -1.30891559e+00, -1.47673906e+00,  1.23613497e+00,  9.83532650e-02,
       -1.00021082e+00,  5.92863177e-01, -6.51418768e-01, -7.12643990e-02,
        9.61759772e-01, -3.52259518e-01,  7.57891122e-01,  5.43894368e-01,
       -1.24517428e+00, -1.16943454e-01,  9.42738567e-03, -1.85214790e-01,
        5.43000340e-01, -5.06087231e-01,  1.87441760e+00,  1.48801193e+00,
       -1.14158502e+00,  8.90236173e-01,  3.81326108e-01, -7.47030048e-01,
        2.14683945e+00, -1.21171900e+00, -1.42735245e+00,  1.72613182e-01,
       -4.94537126e-01, -8.37125311e-01,  1.48845327e+00,  6.51671153e-02,
        2.30779732e-01, -2.67276873e+00, -9.79029924e-01,  1.23021091e+00,
       -3.60864320e-01,  1.60590807e+00,  3.42623567e-01, -1.65138668e+00,
        8.66595026e-01, -6.51493963e-01,  3.79845541e-01,  9.46619986e-01,
       -1.08709327e-01,  2.42949111e+00, -1.82338392e-01,  1.05909346e+00,
        1.43255071e+00,  2.34289443e+00, -8.95538801e-01,  2.22803241e+00,
       -7.80071049e-01,  1.13729254e+00, -4.36655977e-03,  1.32938805e+00,
        2.97423370e-01,  8.59817959e-01,  7.35790794e-01, -3.73260395e-01,
        1.37825189e+00, -6.01771632e-02, -1.23124416e+00,  2.47897060e-01,
       -3.15529897e-01, -1.30752058e+00,  8.37010861e-01,  9.01037842e-01,
       -1.91245602e+00, -1.48888976e-01,  5.38754513e-01,  2.48369584e-01,
       -1.89158216e+00, -1.00232100e+00,  1.04317764e+00, -3.32904170e-01,
        1.52072908e+00,  2.67052331e-02, -1.41153026e+00, -5.93766387e-01,
        6.10386338e-01, -2.94763859e-01,  1.08064663e-01, -3.81471299e-01,
        1.96201959e-02, -1.38734698e+00, -1.09035379e+00, -2.94764423e-01,
       -9.10541515e-01,  5.43320868e-01, -2.33511037e+00, -2.97572792e-01,
       -9.92550059e-02, -6.00641795e-01, -1.78716112e-01, -1.75062944e+00,
        9.29409974e-01, -1.58686032e+00,  7.44945959e-01, -1.04487046e+00,
       -8.21609470e-01,  7.55456015e-01, -9.76115007e-01, -4.48028050e-01,
       -8.84282065e-01,  2.30014518e+00,  1.77186831e-01, -5.21470474e-01,
        1.40978724e+00,  1.37030086e+00,  8.06452882e-01, -2.04924988e+00,
       -4.41040544e-01, -2.22687214e-01,  1.08796928e+00, -4.92104622e-01,
       -1.19510099e-01,  2.27794163e+00,  8.45750378e-01,  2.22653941e+00,
        3.86707738e-01, -1.15120078e+00,  7.71229085e-01,  1.68201201e+00,
        4.90317566e-01, -1.47470801e+00, -1.14148273e+00,  6.28691359e-01,
        1.21905766e-01, -5.79927324e-01, -1.33901733e-01, -8.32019559e-01,
       -3.55276789e-01,  1.28303135e-01, -1.59219238e-01, -7.46337613e-01,
        2.73506790e-02, -5.93962963e-01, -3.33594538e-01, -2.79202558e-01,
       -9.48806710e-01, -2.53944804e-02,  1.30126124e+00,  2.82884258e+00,
       -4.18451372e-01, -1.71648383e+00,  7.20507718e-01,  1.66619799e-01,
       -2.41207619e-01, -1.47256848e+00,  3.41135867e-01,  1.31917251e-02,
        7.39218136e-01, -1.41174013e+00,  2.32559717e-01, -2.30134497e+00,
       -1.36124300e-01,  8.22661990e-01,  3.56936927e-01, -5.36733777e-01,
        5.12759963e-01, -4.89401782e-01,  2.22832205e+00,  6.62609551e-01,
       -1.45693457e-01,  8.44259447e-01,  5.46675313e-01,  5.40347107e-01,
        2.52031513e-02, -1.03267982e+00,  1.03468801e+00,  8.06402653e-01,
       -2.46670041e-01, -5.47570846e-01, -1.56761779e+00,  2.62432697e+00,
        1.61813818e+00, -1.33346191e+00,  2.67175772e+00, -1.90269800e-01,
       -1.62190016e+00, -7.68522456e-01,  2.22915570e-01, -1.14515055e-02,
        6.24384731e-01, -2.09915427e-01,  6.64407850e-01,  9.79660763e-01,
       -3.16516736e-01, -3.04155777e+00,  1.62373924e-01,  2.58405049e-01,
        4.96404064e-01, -1.03173042e+00, -7.24135248e-01,  2.01618904e+00,
        5.81076006e-01,  1.06503634e-01, -1.04812358e-01, -7.48659064e-01,
       -4.95479947e-01,  6.25896275e-01,  6.76955327e-01,  7.77262208e-01,
        9.03984574e-01,  8.87839371e-02, -8.71485969e-01,  1.31512654e+00,
       -2.39793762e+00, -5.22390017e-01, -1.33264479e+00, -8.79119185e-01,
       -1.71295952e-02,  1.38156485e+00, -1.81257985e+00,  2.86159484e+00,
        7.00876373e-01,  7.28203539e-01,  1.65550066e+00,  4.92169834e-01,
       -7.70793250e-01, -1.44544979e+00, -1.49318593e-01,  4.70377170e-01,
       -7.61730388e-01, -1.25362927e+00,  1.24602519e+00,  1.01197562e-01,
        5.28284193e-01, -1.68426001e-01,  1.45100139e+00,  2.78412707e-01,
        5.51035642e-02,  1.73785638e-01, -1.44539151e-01, -1.62849725e+00,
        1.62485037e-01, -8.19581460e-02,  1.79981878e-01,  5.50472212e-01,
       -1.48873446e+00,  1.05161682e-01,  1.51156438e-02,  1.05023596e+00,
        1.25729404e+00,  1.82991642e-01,  1.37731405e+00,  5.52976026e-01,
       -1.01750196e+00, -7.57044171e-01,  9.29489666e-01, -1.53897297e+00,
        7.51484514e-01, -1.29754434e-01, -2.13020476e-01, -8.52647011e-01,
       -9.03506574e-01,  1.30761226e+00, -4.02783956e-01,  1.19252425e+00,
       -2.81716245e-01,  1.15974961e+00, -1.00527533e-01, -1.96369318e-01,
        2.36518060e+00,  5.75023582e-01,  4.75917568e-01, -6.43547295e-01,
        1.14910882e-01, -1.66241189e+00, -2.29461669e+00,  5.81812089e-01,
       -6.46726603e-01,  1.83206483e+00, -2.84468808e-01,  7.45428253e-01,
        6.96395189e-01,  5.86780809e-02,  5.71789929e-01, -6.34966034e-01,
       -1.80243625e+00,  3.46900116e-01,  5.46517112e-01, -1.12005970e+00,
       -1.07375080e+00, -4.06895654e-01,  1.48036701e+00, -1.95781595e+00,
        1.18495043e-01,  1.96182198e+00, -1.98653453e+00, -3.46578958e-01,
       -2.30333871e+00,  1.12215420e-01,  1.20968484e-01,  1.63515854e+00,
        1.05125604e+00,  8.84122952e-01, -4.38876445e-01, -1.40553534e+00,
        4.82788850e-01,  1.53153323e+00, -2.39056813e+00, -2.73959090e-01,
        1.67797886e-01, -2.61348510e-01, -9.18488093e-01,  1.69704447e-01,
        1.30593146e+00, -1.87498373e+00,  4.32278817e-01, -3.77448482e-01,
        1.48959743e+00, -4.67861011e-01,  7.34255508e-01, -8.83253090e-01,
       -3.00022628e-02,  7.65047444e-01, -4.57300989e-01,  1.66133048e-01,
       -4.22616485e-01, -1.01231217e+00,  1.26302565e+00,  2.06255248e+00,
       -9.55716488e-01,  6.54946470e-01, -9.85782428e-01,  5.69179845e-01,
        9.11838556e-01,  1.18297127e+00, -5.93627815e-01, -9.40734058e-01,
        1.13771442e-01,  1.72686020e+00, -1.44613370e+00,  2.26353207e-01,
       -7.97618597e-01,  1.84064243e+00, -4.50016590e-02,  2.15622755e-01,
        4.06681031e-01, -3.69662369e-01,  5.10337811e-02,  5.03506687e-01,
        1.17813230e+00,  6.60367457e-01,  3.77547140e-01,  2.32891559e+00,
        1.06193431e-01, -1.02762874e+00,  8.35544880e-01, -3.59398828e-01,
       -3.85329824e-01, -3.22096434e-01,  1.05360350e+00,  1.26473233e+00,
       -1.25808991e+00,  1.59131545e-01, -7.59383191e-01, -9.75595395e-01,
        3.55040684e-01,  1.19514922e+00,  4.02814560e-01, -1.40620445e+00,
       -7.37484342e-01, -2.47734402e-01,  2.42603708e-02,  4.98245171e-01,
        4.17027447e-01, -1.05526517e+00,  1.04789801e+00,  1.06017926e-02,
       -2.08796974e+00, -1.19447556e+00,  3.41168623e-01,  1.67303205e+00,
       -6.46768568e-01,  1.70389064e+00, -3.14045167e-01, -2.12287438e-01,
       -1.11057554e+00,  1.35065422e+00, -1.13777116e+00, -2.12340190e+00,
       -7.53796795e-01, -9.41135432e-01, -1.16104950e+00, -8.84020857e-01,
        6.67398383e-01, -2.56579290e-01, -1.19610320e+00,  7.31454391e-01,
        8.31234754e-01, -7.86097852e-01, -9.41490374e-01, -1.16120525e+00,
       -5.00096404e-01,  1.04190503e+00, -8.28510707e-01,  8.41726196e-01,
        7.46042599e-01, -5.72441972e-02,  1.18515762e-01, -9.05998804e-02,
       -2.30021437e-01, -1.19009562e+00,  1.03783549e+00,  6.51936446e-01,
       -2.00400645e-01, -3.03472391e-01,  1.36822473e-01,  5.02653729e-01,
        4.08747682e-01, -2.82001065e-01,  1.82042184e+00, -5.23422786e-01,
       -2.12227191e+00,  3.64780178e-01, -2.88529048e-01,  4.40975796e-01,
        4.17684605e-01, -7.76520565e-02,  2.47613415e-01, -7.40483357e-01,
       -1.55908249e-01,  3.37024976e-01,  3.52022426e-01,  6.57302554e-01,
       -9.80851814e-01,  3.96963182e-02, -2.82061700e-01,  5.28700365e-01,
       -1.21820551e+00,  3.90098094e-01,  2.22818483e-01, -1.32094485e+00,
        1.03197736e+00,  7.61212670e-01, -4.25411064e-01,  2.37865205e+00,
        3.19645320e-01, -1.93578666e-01, -3.95451318e-01, -8.43725323e-01,
       -6.33875548e-01,  3.18252862e-01,  1.51911991e+00, -1.59513538e+00,
        1.01134778e+00,  2.53510057e-01,  5.24860360e-01, -1.42854933e+00,
       -3.76131722e-01, -6.57670841e-01, -1.24180543e-01, -1.23359432e+00,
       -1.36057206e+00,  6.03240504e-01, -1.27410071e+00,  8.09150449e-01,
       -1.03410709e+00, -6.31168197e-01, -4.22276827e-01,  1.22178689e+00,
       -1.28611316e+00, -4.36674591e-01, -1.22828893e+00, -7.05335823e-01,
       -1.67942403e+00,  4.85801407e-01,  4.56654706e-01, -1.05569820e+00,
        4.13550748e-02,  1.29843806e+00, -1.35580914e+00,  1.69428360e-01,
       -6.66378817e-01, -1.28445803e+00, -9.78343234e-01,  1.44478904e-01,
       -9.62405255e-01,  7.89991079e-01, -1.65687739e+00, -1.89872067e-01,
        3.02556537e-01, -1.09798133e+00,  1.52010523e+00,  2.67480256e-01,
        6.18073238e-01, -6.09749456e-01,  1.19349192e+00, -1.63206975e+00,
        5.52138551e-02,  1.58086488e+00,  9.64037208e-01,  4.28878468e-01,
       -2.29132498e-01, -4.13910357e-01,  1.57113605e+00,  5.19436317e-01,
        1.71372690e+00,  2.23876100e-01,  3.00280556e-01, -7.81923727e-02,
        7.16393691e-02, -6.56825909e-01,  4.86401701e-01,  2.00701205e+00,
       -7.74211418e-02, -2.12631846e-01, -3.58057287e-01,  8.15827060e-01,
       -1.04043152e+00,  1.69753670e-01,  7.56596863e-01,  1.56455856e+00,
       -1.32976389e-02, -4.81371482e-01,  5.43032111e-01,  3.57554119e-01,
        1.60917684e+00, -2.94387423e-01, -6.55031885e-02,  5.04749603e-01,
       -9.66992175e-01,  7.01569817e-02,  2.07414124e-01, -2.88297338e+00,
        2.27770702e-01,  9.71961503e-01, -9.23379226e-01, -6.08916486e-01,
       -2.63334485e-01, -2.13627905e-01,  6.40860196e-01,  3.68129906e-01,
       -6.82506335e-01,  1.68271170e-01,  1.01726369e+00,  7.76589110e-01,
       -1.15989739e-01, -1.66664712e+00,  2.84784639e-01, -1.94232406e+00,
        6.65250546e-01,  7.35528484e-01,  2.81341448e-01, -1.37031109e+00,
        9.06735068e-01, -4.78144269e-02,  7.85093968e-01, -3.38142315e-01,
       -8.79589533e-01,  9.30898446e-02, -1.14412710e+00, -1.99201740e+00,
       -4.44920176e-01,  1.40835347e+00,  1.53156559e+00, -8.26441108e-01,
       -2.61628930e-01,  1.14652645e+00,  1.35837110e+00, -4.46705743e-01,
        6.24745642e-01,  1.04163149e+00, -1.23472728e+00, -2.64610991e-01,
        8.21326836e-01, -7.75661051e-02,  4.64978288e-01, -8.50637460e-01,
       -2.63583375e+00,  7.58775080e-01, -2.98644573e-01, -1.51010433e-01,
        7.36835295e-01, -4.22471335e-01,  6.57157360e-01,  1.13897540e+00,
       -2.67749330e-01, -1.44324148e-01,  1.57339673e+00,  3.64977311e-01,
       -9.10059595e-01, -9.76894876e-01, -1.63594131e+00,  2.67562897e-01,
        8.84647754e-01, -2.37350743e-01,  3.50784931e-01,  1.80857439e-01,
       -5.11157660e-01, -2.27302072e-01,  1.97790183e+00,  1.27219452e-01,
        1.35988114e+00,  8.00746404e-01,  2.71974592e-01,  9.47420829e-02,
        4.47277730e-01, -2.91809015e-01, -7.05103584e-02,  1.54416721e-01,
        4.63516473e-01, -1.45689099e+00, -1.62424417e-01, -7.58609434e-01,
        2.14232025e+00, -2.73203985e-02, -8.53788331e-01, -1.55628188e+00,
        9.87375234e-01,  7.29799578e-01,  2.60250080e-01, -2.12425792e-02,
        8.51175993e-01, -2.18614504e+00,  1.94636174e+00,  6.82516444e-01,
       -1.59170133e-01,  1.95112326e+00,  2.40269702e-01, -1.76196951e+00,
        1.83132249e+00, -1.66264337e+00,  5.36018971e-01, -4.62973363e-01,
        3.89786698e-01, -9.83450083e-02,  1.10555161e+00, -4.39728718e-01,
       -8.01357274e-01, -7.16360149e-01,  6.89015430e-02, -1.71854885e+00,
       -1.01543460e+00,  7.31097682e-01, -4.88416544e-01,  8.72112717e-01,
       -2.18476691e+00,  6.53208719e-01,  2.43201974e-01, -5.71779363e-01,
       -2.12871238e-01, -4.33913522e-01, -7.64660682e-01,  3.83042084e-01,
        1.24916233e+00, -3.59882535e-01, -5.69809499e-01,  1.41325820e-01,
       -1.06369921e+00, -4.43262938e-01, -7.50780820e-01,  3.19373426e-01,
        9.93654828e-01,  1.02398029e+00,  1.29821793e+00, -3.64670244e-03,
       -4.38265041e-01, -3.31352526e-01,  1.58960319e+00, -5.61211490e-01,
       -2.30245202e-01,  2.67013962e+00, -1.10605578e+00,  1.82150542e+00,
        7.46353241e-01,  3.46570341e-01,  5.72686601e-01, -2.45496037e+00,
        6.33027885e-01,  4.99004452e-01, -2.20437050e-01,  1.35473412e+00,
        8.84045788e-01, -2.34867333e-01, -1.56378942e+00, -2.74272407e-01,
       -5.10165734e-01, -5.03978845e-02,  1.52420469e+00,  1.15952490e+00,
        1.18523167e+00,  2.72059233e+00, -6.87896827e-01, -8.96957950e-01,
       -2.91672711e-01, -3.86862813e-02, -1.17116929e-01, -1.73443454e+00,
        2.41322422e-01,  1.54811761e+00, -2.05729599e-01, -6.83437926e-01,
       -4.42348847e-01,  8.63814474e-01, -1.72416103e-01,  7.16681426e-02,
        7.11986074e-01, -2.54150663e-01,  2.92647559e-01, -3.17695089e-01,
       -1.64636880e-01, -1.41957240e+00,  1.75820007e+00, -1.10568225e+00,
        9.57584993e-01,  1.08497333e+00,  1.87173885e+00, -6.82387464e-01,
        8.24125147e-02, -1.91910912e+00, -1.12720359e+00, -1.07694448e+00,
        5.41669617e-01, -2.42897867e-01, -2.23328359e+00, -6.16770554e-01,
        9.94510344e-01,  6.47010617e-01, -1.93089740e-01, -9.56482849e-01,
        1.13850756e+00, -4.75814592e-01,  1.06608657e+00,  1.88955831e-01,
        8.52340123e-01, -1.81815707e+00,  6.79324095e-01,  5.09234519e-01,
       -5.68124658e-01,  5.01479526e-01,  7.29715035e-01,  3.10734628e-01,
       -9.42741045e-01,  4.46936211e-01, -7.73951097e-01,  8.57586161e-01,
       -5.83000810e-01, -4.99988891e-01,  6.61234756e-02, -1.57953174e+00,
       -1.24685759e+00, -6.21809123e-02,  9.15936670e-01,  6.44227782e-02,
        9.31049530e-01,  1.87225527e+00, -3.03650857e-01, -3.12150938e+00,
        6.83454719e-01, -1.04188192e+00, -1.97338503e+00, -1.30928582e+00,
       -5.16422867e-01,  1.17964199e+00,  1.99937051e-01,  8.06230967e-01,
        1.19986453e+00, -2.38338540e+00, -2.21894578e-01,  2.28791203e-01,
       -1.12485334e+00, -6.98192852e-01,  1.77788631e-01,  1.57058014e+00,
        1.41220680e+00,  2.05726835e+00, -9.48221670e-01,  2.65379569e-01,
       -2.73606765e-01, -8.87453600e-02,  1.27074000e-01,  1.16927071e-02,
        1.49605708e+00,  1.26700166e+00, -1.61682257e+00, -2.09502293e+00,
        6.30567985e-01,  1.26473233e+00, -1.39045127e+00,  7.60191710e-01,
        7.92204882e-01,  5.75355641e-01, -2.63469588e-01,  1.74748705e-01,
       -9.35216640e-01, -9.33878303e-02, -1.22729538e+00,  3.08813794e-01,
        8.25773766e-01,  2.36774974e-01, -1.11499497e+00,  7.49915807e-01,
        2.15035802e-01, -2.28452087e-01, -1.11614203e+00, -6.79789236e-01,
       -1.25926538e+00, -1.78517851e+00,  1.32404626e+00, -6.06490678e-02,
       -3.98399164e-01,  1.59842283e+00,  6.67906307e-02, -8.71613156e-01,
       -4.47461197e-01,  4.75528186e-03, -8.49551287e-01,  8.17239419e-01,
       -1.22635610e+00, -6.83610490e-01, -9.95670732e-01, -9.23272417e-01,
       -2.81941457e+00,  4.19571600e-01,  1.24917195e+00, -1.74426513e+00,
       -4.47872868e-01, -1.11030243e-02, -7.59517558e-01,  2.80728540e-01,
        6.90610167e-01, -7.22493734e-01, -8.56824544e-01, -2.19389813e+00,
        7.21639055e-01,  2.33118319e-02, -9.06887106e-01,  4.36299240e-01,
        1.84196516e-02,  4.09913933e-01,  1.63469170e+00,  3.66498000e-01,
        3.79687999e-01, -6.40553234e-01, -1.53945672e+00, -1.60530424e+00,
       -4.50361388e-01,  1.46272316e+00, -2.69558264e-01, -1.32484439e+00])

In [84]:
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q3', 'Q1', 'Q2', 'Q4', ..., 'Q1', 'Q2', 'Q4', 'Q2', 'Q1']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [85]:
cats.value_counts()

Q1    250
Q2    250
Q3    250
Q4    250
Name: count, dtype: int64

## 연습문제 7

타이타닉호 승객을 '미성년자', '청년', '중년', '장년', '노년' 나이 그룹으로 나눈다.

bins = [1, 20, 40, 50, 70, 100]  
labels = ["미성년자", "청년", "중년", "장년", "노년"]

그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [86]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female35
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,female19
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,female29
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32

In [87]:
bins = [1, 20, 40, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [93]:
df5 = pd.cut(titanic['age'], bins, labels=labels)
df5

0        청년
1        청년
2        청년
3        청년
4        청년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      청년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [99]:
df5.value_counts(normalize=True) * 100

age
청년      64.082098
미성년자    18.814139
중년       9.806157
장년       6.727480
노년       0.570125
Name: proportion, dtype: float64

## 연습문제 8

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 `category3` 열을 만들어라. `category3` 카테고리는 다음과 같이 정의된다.

1. 20살 미만이면 성별에 관계없이 "미성년자"라고 한다.
2. 20살 이상이면 나이에 따라 "청년", "중년", "장년", "노년"을 구분하고 그 뒤에 성별을 나타내는 "남성", "여성"을 붙인다.

In [100]:
bins = [1, 20, 40, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [103]:
titanic['category3'] = pd.cut(titanic['age'], bins, labels=labels)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2,category3
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38,청년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female35,청년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male35,청년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27,청년
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,female19,미성년자
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,female29,청년
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26,청년
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32,청년

In [106]:
titanic['category3'] = titanic.apply(lambda x: '미성년자' if x.age < 20 else 
             (x.category3 + '남성' if x.sex == 'male' else 
             x.category3 + '여성'), axis=1)

In [107]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2,category3
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22,청년남성
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38,청년여성
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26,청년여성
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female35,청년여성
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male35,청년남성
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27,청년남성
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,female19,미성년자
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,female29,청년여성
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26,청년남성
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32,청년남성